# Contents
01. Import Libraries
02. Import Data Frame
03. Renaming Columns For Clarity
04. Checking Data Types
05. Checking For Missing Values
06. Checking For Duplicates
07. Merging with Ords_Prods Dataframe
08. Exporting File as Pickle

# 01. Import Libraries

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

# 02. Import Data Frame

In [2]:
#Set file path
path = r'C:\users\campa\data projects\instacart basket project'

In [3]:
#Import customers.csv
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
#Check df shape
df_cust.shape

(206209, 10)

In [5]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# 03. Renaming columns for clarity

In [6]:
#renaming 'Surnam' column 'last name' to be consistent with 'First Name'
df_cust.rename(columns = {'Surnam' : 'Last Name'}, inplace = True)

In [20]:
# renaming "fam_status" colunm 'marital status'
df_cust.rename(columns = {'fam_status' : 'Marital Status'}, inplace = True)

# 04. Checking Data Types

In [9]:
#Check column data types
df_cust.dtypes

user_id          int64
First Name      object
Last Name       object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [10]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [12]:
# Check for mixed types

for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird]) > 0:
        print(col)

First Name

In [13]:
#Chaning first name to string
df_cust['First Name'] = df_cust['First Name'].astype('str')

In [15]:
df_cust['First Name'].dtype

dtype('O')

In [16]:
df_cust.dtypes

user_id          int64
First Name      object
Last Name       object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# 05. Checking for Missing Values

In [17]:
#Check for missing values
df_cust.isnull().sum()

user_id         0
First Name      0
Last Name       0
Gender          0
STATE           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

# 06. Checking For Duplicates

In [18]:
#Checking for duplicate values
df_dups = df_cust[df_cust.duplicated()]

In [19]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, STATE, Age, date_joined, n_dependants, fam_status, income]
Index: []

# 07. Merging with With Ords_Prods Dataframe

In [23]:
#Importing Ords_prods
ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'Ords_prod_merged_11262022.pkl'))

In [24]:
ords_prods.shape

(32404859, 22)

In [25]:
ords_prods.head()

,Unnamed: 0_x,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,...,aisle_id,department_id,prices,price_range_loc,Busiest Days,busiest_period_of_day,max_order,loyalty_flag,Average_spending,Spending_Flag
0,0,2539329,1,1,2,8,NaN,196,1,0,...,77,7,9.0,Mid-Range Product,Regularly Busy,Average Orders,10,New customer,6.367797,Low Spender
1,1,2398795,1,2,3,7,15.0,196,1,1,...,77,7,9.0,Mid-Range Product,Least Busy,Average Orders,10,New customer,6.367797,Low Spender
2,2,473747,1,3,3,12,21.0,196,1,1,...,77,7,9.0,Mid-Range Product,Least Busy,Most Orders,10,New customer,6.367797,Low Spender
3,3,2254736,1,4,4,7,29.0,196,1,1,...,77,7,9.0,Mid-Range Product,Least Busy,Average Orders,10,New customer,6.367797,Low Spender
4,4,431534,1,5,4,15,28.0,196,1,1,...,77,7,9.0,Mid-Range Product,Least Busy,Most Orders,10,New customer,6.367797,Low Spender

In [26]:
df_cust.head()

,user_id,First Name,Last Name,Gender,STATE,Age,date_joined,n_dependants,Marital Status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [27]:
# Merging dataframes
cust_ords_prods_merged = df_cust.merge(ords_prods, on = 'user_id')

In [28]:
#checking shape and stats of new dataframe
cust_ords_prods_merged.shape

(32404859, 31)

In [29]:
cust_ords_prods_merged.head()

,user_id,First Name,Last Name,Gender,STATE,Age,date_joined,n_dependants,Marital Status,income,...,aisle_id,department_id,prices,price_range_loc,Busiest Days,busiest_period_of_day,max_order,loyalty_flag,Average_spending,Spending_Flag
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,77,7,9.0,Mid-Range Product,Busiest Day,Most Orders,8,New customer,7.988889,Low Spender
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,77,7,9.0,Mid-Range Product,Regularly Busy,Most Orders,8,New customer,7.988889,Low Spender
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,77,7,9.0,Mid-Range Product,Busiest Day,Most Orders,8,New customer,7.988889,Low Spender
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,120,16,12.6,Mid-Range Product,Regularly Busy,Most Orders,8,New customer,7.988889,Low Spender
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,120,16,12.6,Mid-Range Product,Least Busy,Most Orders,8,New customer,7.988889,Low Spender

# 08. Exporting New Dataframe

In [30]:
#exporting cust_ords_prods_merged as pickle
cust_ords_prods_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'Cust_Ords_Prods_Merged.pkl'))